'use client'

export default function About() {
	return (
		<div>
			<h1 className='pb-8 text-3xl'>О проекте</h1>
			<h2 className='text-2xl'>Что такое Дока</h2>
			<p className='pt-8 text-xl'>
				Дока — это добрый справочник для POS-инженеров. Почему добрый? Потому
				что мы заботимся о том, чтобы наши материалы были актуальны, точны,
				понятны и полезны. Дока — это место, где аккумулируются знания
				сообщества: от формального списка оборудования до реальных случаев
				применения. Наше кредо — расскажи просто, покажи красиво.
			</p>
			<p className='text-xl'>
				Доку создают POS-инженеры для POS-инженеров. Это открытый проект, внести
				вклад в него может каждый. Контент, код и планы по развитию Доки лежат в
				публичной организации на GitHub. Правила участия, обсуждения и ревью
				проходят открыто для всех желающих. Дока принадлежит всем, кто ей
				пользуется.
			</p>
			<h2 className='pt-8 text-2xl'>Чего мы хотим</h2>
			<p className='py-8 text-xl'>
				Мы хотим, чтобы у сообщества POS-инженеров были хорошие и понятные
				справочные материалы на русском языке, написанные с умом и не унылые. Мы
				хотим помогать тем, кто только учится и уже состоявшимся специалистам.
				Хорошая документация никогда не бывает лишней, ведь так?
			</p>
			<h2 className='text-2xl'>Ваш ход!</h2>
			<p className='py-8 text-xl'>
				Дока — это вы, это ваш опыт и знания, которыми вы хотите поделиться с
				сообществом. Вы можете писать статьи, предлагать уточнения и правки,
				помогать с развитием платформы — словом, вы можете делать все, что по
				вашему мнению сделает Доку лучше. Почитайте о том, как присоединиться к
				работе над Докой и влиться в сообщество замечательных людей, которые уже
				внесли свой вклад.
			</p>
		</div>
	)
}
